Documents/ОбращенияВПоддержку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОбращенияВПоддержку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РегистрНакопления</xr:Item>
				<xr:Item>InformationRegister.ИсторияИзмененийОбращений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПоступления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРеакцииФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРешенияФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тональность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоНазначениеОтветственного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РешитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРеакцииРегламент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРешенияРегламент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияСообщений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаВремя</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/НагрузкаСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НагрузкаСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоОбращений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОжидании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/КатегорииОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КатегорииОбращений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяРеакции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРешения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ОбращенияВПоддержку/Ext/ObjectModule.bsl
&НаСервере
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если РежимЗаписи = РежимЗаписиДокумента.Запись
		И ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Новое
		И (ЭтотОбъект.ВремяРеакцииРегламент = 0 ИЛИ ЭтотОбъект.ВремяРешенияРегламент = 0)
		И Не ПустаяСтрока(ЭтотОбъект.Категория) Тогда	
		ЗаполнитьВремяПоКатегории() 
	КонецЕсли;
    вр = ЭтотОбъект.ВремяРешенияРегламент;
	// При записи нового обращения запускается функция автоматического назначения ответственного
	// Если ответственный назначается вручную, то этв функция не вызываестя 
	// Функция НазначитьОтветственногоПоКомпетенциямИНагрузке написана в модуле менеджера в справочнике Сотрудники
	
    Если РежимЗаписи = РежимЗаписиДокумента.Запись 
		//И ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Новое 
        И Не ПустаяСтрока(ЭтотОбъект.Категория)
		И Не ПустаяСтрока(ЭтотОбъект.Приоритет)
		И ЭтотОбъект.АвтоНазначениеОтветственного = Истина
		И ПустаяСтрока(Ответственный) Тогда
        
		//Ответственный = Справочники.Сотрудники.НазначитьОтветственногоПоКомпетенциямИНагрузке(ЭтотОбъект.Категория);
		//Если Ответственный <> Неопределено Тогда
		//    ЭтотОбъект.Ответственный = Ответственный;
		//КонецЕсли; 
		
		Ответственный = Справочники.Сотрудники.НазначитьОтветственногоПоКомпетенциямИНагрузке(ЭтотОбъект.Категория);
        Если Не ПустаяСтрока(Ответственный) Тогда
            ЭтотОбъект.Ответственный = Ответственный;
		Иначе 
			ЭтотОбъект.АвтоНазначениеОтветственного = Ложь;
		КонецЕсли;
		
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Запись 
		//И ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Новое 
        И ПустаяСтрока(ЭтотОбъект.Категория)
		И ПустаяСтрока(ЭтотОбъект.Приоритет)
		И ПустаяСтрока(Ответственный) Тогда
 
		ЭтотОбъект.АвтоНазначениеОтветственного = Ложь;
        
	КонецЕсли; 
		 
	//Если ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Выполнено Тогда
	//    РежимПроведения = РежимЗаписиДокумента.Проведение;
	//КонецЕсли;
	
	//Если РежимЗаписи = РежимЗаписиДокумента.Запись 
	//    И ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Выполнено Тогда
	//    
	//    // Устанавливаем флаг проведения
	//    Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
	//        РежимПроведения = РежимПроведенияДокумента.Проведение;
	//    КонецЕсли;
	//    
	//    // Можно добавить дополнительную проверку перед проведением
	//    Если ЭтотОбъект.Ответственный = Неопределено Тогда
	//        Сообщить("Внимание: обращение завершено, но ответственный не назначен!");
	//    КонецЕсли;
	//    
	//КонецЕсли;
	
	
	РассчитатьВремяРеакцииИРешения();

    
КонецПроцедуры


&НаСервере
Процедура ПриЗаписи(Отказ, РежимЗаписи)
    
    // Обновляем нагрузку в регистре сведений НагрузкаСотрудников  при записи документа
	//Если ЭтотОбъект.Ответственный <> Неопределено Тогда
	//    ОбновитьНагрузкуСотрудника(ЭтотОбъект.Ответственный);
	//КонецЕсли;  
	Если Не ПустаяСтрока(ЭтотОбъект.Ответственный) Тогда
        ОбновитьНагрузкуСотрудника(ЭтотОбъект.Ответственный);
	КонецЕсли; 
	
	//Если ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Выполнено 
	//    И Не ЭтотОбъект.Проведен Тогда
	//    
	//    // Пытаемся провести документ
	//    Попытка
	//        ЭтотОбъект.Провести();
	//    Исключение
	//        // Логирование ошибки (опционально)
	//        // ЗаписьЖурналаРегистрации("Не удалось автоматически провести обращение: " + ОписаниеОшибки());
	//    КонецПопытки;
	//КонецЕсли;
	
КонецПроцедуры




&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
    
    // Обновляем нагрузку при смене ответственного   
	Если ЭтотОбъект.Статус <> Перечисления.СтатусыЗаявок.Выполнено Тогда
        
        ОбновитьНагрузкуСотрудника(ЭтотОбъект.Ответственный);
	КонецЕсли;
	
	//Если ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.ВРаботе 
	//    ИЛИ ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.КВыполнению Тогда
	//    
	//    ОбновитьНагрузкуСотрудника(ЭтотОбъект.Ответственный);
	//КонецЕсли;
    
КонецПроцедуры

//&НаСервере
//Процедура СтатусПриИзменении(Элемент) 
//    
//    // Обновляем нагрузку при изменении статуса
//	//Если ЭтотОбъект.Ответственный <> Неопределено Тогда
//	//    ОбновитьНагрузкуСотрудника(ЭтотОбъект.Ответственный);
//	//КонецЕсли;  
//	    
//КонецПроцедуры

&НаСервере
Процедура ОбновитьНагрузкуСотрудника(Сотрудник)
    
    Если Сотрудник = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
	ТекДата = НачалоДня(ТекущаяДата()); 
	//ТекДата = НачалоДня(Дата('2025.11.26 10:45:25')); 
    Нагрузка = РассчитатьТекущуюНагрузкуИзДокументов(Сотрудник, ТекДата);
    
    // Запись в регистр НагрузкаСотрудников
    НаборЗаписей = РегистрыСведений.НагрузкаСотрудников.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
    НаборЗаписей.Отбор.Дата.Установить(ТекДата);
    НаборЗаписей.Прочитать();
    
    Если НаборЗаписей.Количество() > 0 Тогда
        // Обновление существующей записи
        Запись = НаборЗаписей[0];
    Иначе
        // Создание новой
        Запись = НаборЗаписей.Добавить();
        Запись.Сотрудник = Сотрудник;
        Запись.Дата = ТекДата;
    КонецЕсли;
    
    Запись.КоличествоОбращений = Нагрузка;
    НаборЗаписей.Записать();
    
КонецПроцедуры

&НаСервере
Функция РассчитатьТекущуюНагрузкуИзДокументов(Сотрудник, ТекДата)
    
    // В регистр записываются только новые обращения на текущую дату
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   COUNT(Обращения.Ссылка) КАК КоличествоОбращений
    |ИЗ
    |   Документ.ОбращенияВПоддержку КАК Обращения
    |ГДЕ
    |   Обращения.Ответственный = &Сотрудник
    |   И Обращения.Статус = &СтатусНовое
	|	И Обращения.Дата МЕЖДУ &НачалоДня И &КонецДня";
	

    Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("СтатусНовое", Перечисления.СтатусыЗаявок.Новое);
	Запрос.УстановитьПараметр("НачалоДня", ТекДата);
    Запрос.УстановитьПараметр("КонецДня", КонецДня(ТекДата));
	//Запрос.УстановитьПараметр("СтатусВРаботе", Перечисления.СтатусыЗаявок.ВРаботе);
	//Запрос.УстановитьПараметр("СтатусКВыполнению", Перечисления.СтатусыЗаявок.КВыполнению);
    
    Результат = Запрос.Выполнить().Выбрать();
    Если Результат.Следующий() Тогда
        Возврат Результат.КоличествоОбращений;
    Иначе
        Возврат 0;
    КонецЕсли;
    
КонецФункции  



&НаСервере
Процедура РассчитатьВремяРеакцииИРешения()
	
    ТекущееВремя = ТекущаяДата();
    
    // Время реакции рассчитывается когда обращение переходит в статус ВРаботе или КВыполнению
    Если (ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.ВРаботе 
        ИЛИ ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.КВыполнению)
        И (ЭтотОбъект.ВремяРеакцииФакт = Неопределено ИЛИ ЭтотОбъект.ВремяРеакцииФакт = 0) Тогда
        
        // Разница между текущим временем и датой создания
        РазницаВремени = ТекущееВремя - ЭтотОбъект.ДатаСоздания;
        ЭтотОбъект.ВремяРеакцииФакт = РазницаВремени;
    КонецЕсли;
    
	// Время решения рассчитывается когда обращение Выполнено
	Если ЭтотОбъект.Статус = Перечисления.СтатусыЗаявок.Выполнено
	    И (ЭтотОбъект.ВремяРешенияФакт = Неопределено ИЛИ ЭтотОбъект.ВремяРешенияФакт = 0) Тогда
	    
	    // Разница между текущим временем и датой создания (секунды)
	    РазницаВремени = ТекущееВремя - ЭтотОбъект.ДатаСоздания;
	    ЭтотОбъект.ВремяРешенияФакт = РазницаВремени;
	КонецЕсли;
    
КонецПроцедуры

 


&НаСервере
Процедура ЗаполнитьВремяПоКатегории()
    
    Если ЭтотОбъект.Категория = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Получаем данные из справочника КатегорииОбращений
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   КатегорииОбращений.ВремяРеакции КАК ВремяРеакции,
    |   КатегорииОбращений.ВремяРешения КАК ВремяРешения
    |ИЗ
    |   Справочник.КатегорииОбращений КАК КатегорииОбращений
    |ГДЕ
    |   КатегорииОбращений.Ссылка = &Категория";
    
    Запрос.УстановитьПараметр("Категория", ЭтотОбъект.Категория);
    
    Результат = Запрос.Выполнить().Выбрать();
    Если Результат.Следующий() Тогда
        // Заполняем реквизиты времени
        ЭтотОбъект.ВремяРеакцииРегламент = Результат.ВремяРеакции;
        ЭтотОбъект.ВремяРешенияРегламент = Результат.ВремяРешения;
        
        // Рассчитываем даты "Принять до" и "Решить до"
		//РассчитатьСрокиОбработки();
	КонецЕсли;
	
	// Рассчитываем "Принять до" (дата создания + время реакции)
            
    ЭтотОбъект.ПринятьДо = ЭтотОбъект.Дата + (ЭтотОбъект.ВремяРеакцииРегламент * 3600); 
	ЭтотОбъект.РешитьДо = ЭтотОбъект.Дата + (ЭтотОбъект.ВремяРешенияРегламент * 3600);	
        
    
    
КонецПроцедуры

//&НаСервере
//Процедура РассчитатьСрокиОбработки()
//    
//    Если Объект.ТекущееОбращение.Дата = Неопределено Тогда
//        Возврат;
//    КонецЕсли;
//    
//    // Рассчитываем "Принять до" (дата создания + время реакции)
//    Если Объект.ТекущееОбращение.ВремяРеакции <> Неопределено 
//        И Объект.ТекущееОбращение.ВремяРеакции > 0 Тогда
//        
//        Объект.ПринятьДо = Объект.ТекущееОбращение.Дата + (Объект.ТекущееОбращение.ВремяРеакции * 3600); 
//		
//    КонецЕсли;
//    
//    // Рассчитываем "Решить до" (дата создания + время решения)
//    Если Объект.ТекущееОбращение.ВремяРешения <> Неопределено 
//        И Объект.ТекущееОбращение.ВремяРешения > 0 Тогда
//        
//        Объект.РешитьДо = Объект.ТекущееОбращение.Дата + (Объект.ТекущееОбращение.ВремяРешения * 3600);
//    КонецЕсли;
//    
//КонецПроцедуры




//"ВЫБРАТЬ
//    |   COUNT(Обращения.Ссылка) КАК КоличествоОбращений
//    |ИЗ
//    |   Документ.ОбращенияВПоддержку КАК Обращения
//    |ГДЕ
//    |   Обращения.Ответственный = &Сотрудник
//    |   И (Обращения.Статус = &СтатусНовое
//	|		ИЛИ Обращения.Статус = &СтатусВРаботе 
//    |       	ИЛИ Обращения.Статус = &СтатусКВыполнению)";
